innerIndex = [
    [
        {'label': '001. 경영', 'value': ['사회조사분석사', '소비자전문상담사', '컨벤션기획사']},
        {'label': '002. 회계', 'value': ['전산회계운용사']},
        {'label': '003. 사무', 'value': ['비서', '워드프로세서', '컴퓨터활용능력', '한글속기']},
        {'label': '004. 생산관리', 'value': ['포장산업기사', '품질경영산업기사', '포장기사', '품질경영기사', '공장관리기술사', '포장기술사', '품질관리기술사']},
    ], 
    [
        {'label': '011. 교육/자연과학/사회과학', 'value': ['이러닝운영관리사']},
    ], 
    [
        {'label': '021. 보건/의료', 'value': ['임상심리사', '국제의료관광코디네이터']},
    ], 
    [
        {'label': '031. 사회복지/종교', 'value': ['직업상담사']},
    ], 
    [
        {'label': '042. 디자인', 'value': ['웹디자인기능사', '제품응용모델링기능사', '컴퓨터그래픽스운용기능사', '시각디자인산업기사', '제품디자인산업기사', '컬러리스트산업기사', '서비스경험디자인기사', '시각디자인기사', '제품디자인기사', '컬러리스트기사', '제품디자인기술사']},
        {'label': '043. 방송', 'value': ['영사기능사', '영사산업기사']},
    ],
    [
        {'label': '051. 운전/운송', 'value': ['농기계운전기능사', '철도운송산업기사']},
    ], 
    [
        {'label': '061. 영업/판매', 'value': ['전자상거래관리사', '전자상거래운용사', '텔레마케팅관리사']},
    ], 
    [
        {'label': '071. 이용/미용', 'value': ['이용사', '미용사(일반,피부,네일,메이크업)', '이용장', '미용장']},
        {'label': '072. 숙박/여행/오락/스포츠', 'value': ['스포츠경영관리사']},
    ], 
    [
        {'label': '081. 조리', 'value': ['한식조리기능사', '중식조리기능사', '양식조리기능사', '일식조리기능사', '복어조리기능사', '조주기능사', '한식조리산업기사', '중식조리산업기사', '양식조리산업기사', '일식조리산업기사', '복어조리산업기사', '조리기능장']},
    ], 
    [
        {'label': '091. 채광', 'value': ['광산보안기능사', '시추기능사', '화약취급기능사', '광산보안산업기사', '화약류관리산업기사', '광산보안기사', '화약류관리기사', '자원관리기술사', '화약류관리기술사']},
        {'label': '092. 광해방지', 'value': ['광해방지기사', '광해방지기술사']},
    ], 
    [
        {'label': '101. 금속/재료', 'value': ['금속재료시험기능사', '압연기능사', '열처리기능사', '제강기능사', '제선기능사', '축로기능사', '금속재료산업기사', '재료조직평가산업기사', '금속재료기사', '금속재료기능장', '압연기능장', '제강기능장', '제선기능장', '금속가공기술사', '금속재료기술사', '금속제련기술사', '세라믹기술사']},
        {'label': '102. 판금/제관/새시', 'value': ['금속재창호기능사', '판금제관기능사', '플라스틱창호기능사', '판금제관산업기사', '판금제관기능장']},
        {'label': '103. 단조/주조', 'value': ['주조기능사', '주조산업기사', '주조기능장']},
        {'label': '104. 용접', 'value': ['피복아크용접기능사', '가스텅스텐아크용접기능사', '이산화탄소가스아크용접기능사', '용접산업기사', '용접기사', '용접기능장', '용접기술사']},
        {'label': '105. 도장/도금', 'value': ['금속도장기능사', '표면처리기능사', '표면처리산업기사', '표면처리기능장', '표면처리기술사']},
    ], 
    [
        {'label': '111. 화공', 'value': ['화학분석기능사', '화약류제조산업기사', '바이오화학제품제조산업기사', '정밀화학기사', '화공기사', '화약류제조기사', '화학분석기사', '바이오화학제품제조기사', '화공기술사']},
        {'label': '112. 위험물', 'value': ['위험물기능사', '위험물산업기사', '위험물기능장']},
    ], 
    [
        {'label': '121. 섬유', 'value': ['염색기능사(날염)', '염색기능사(침염)', '섬유산업기사', '섬유디자인산업기사', '섬유기사', '의류기사', '섬유기술사', '의류기술사']},
        {'label': '122. 의복', 'value': ['남성복기능사', '여성복기능사', '신발제조기능사', '세탁기능사', '한복기능사', '신발산업기사', '패션디자인산업기사', '패션머천다이징산업기사', '한복기능장']},
    ], 
    [
        {'label': '131. 전기', 'value': ['전기기능사', '철도전기신호기능사', '전기산업기사', '전기공사산업기사', '전기철도산업기사', '철도신호산업기사', '전기기사', '전기공사기사', '전기철도기사', '철도신호기사', '전기기능장', '건축전기설비기술사', '발송배전기술사', '전기응용기술사', '전기철도기술사', '철도신호기술사']},
        {'label': '132. 전자', 'value': ['의료전자기능사', '전자계산기기능사', '전자기능사', '전자캐드기능사\x03D프린터운용기능사', '광학기기산업기사', '반도체설계산업기사', '의공산업기사', '전자계산기제어산업기사', '전자산업기사\x03D프린터개발산업기사', '광학기사', '로봇기구개발기사', '로봇소프트웨어개발기사', '로봇하드웨어개발기사', '의공기사', '전자계산기기사', '전자기사', '임베디드기사', '전자기능장', '산업계측제어기술사', '전자응용기술사']},
    ], 
    [
        {'label': '141. 정보기술', 'value': ['정보기기운용기능사', '정보처리기능사', '사무자동화산업기사', '정보처리산업기사', '정보보안산업기사', '빅데이터분석기사', '전자계산기조직응용기사', '정보처리기사', '정보보안기사', '정보관리기술사', '컴퓨터시스템응용기술사', '게임그래픽전문가', '게임기획전문가', '게임프로그래밍전문가', '멀티미디어콘텐츠제작전문가']},
        {'label': '142. 방송/무선', 'value': ['방송통신기능사', '무선설비기능사', '방송통신산업기사', '무선설비산업기사', '방송통신기사', '무선설비기사']},
        {'label': '143. 통신', 'value': ['전파전자통신기능사', '통신기기기능사', '통신선로기능사', '전파전자통신산업기사', '정보통신산업기사', '통신선로산업기사', '전파전자통신기사', '정보통신기사', '통신설비기능장', '정보통신기술사']},
    ], 
    [
        {'label': '151. 식품', 'value': ['식품가공기능사', '식품산업기사', '수산제조기사', '식품안전기사', '식육가공기사', '수산제조기술사', '식품기술사']},
        {'label': '152. 제과/제빵', 'value': ['떡제조기능사', '제과기능사', '제빵기능사', '제과산업기사', '제빵산업기사', '제과기능장']},
    ],
    [ 
    
        {'label': '161. 인쇄/사진', 'value': ['사진기능사', '전자출판기능사', '인쇄기능사', '디지털인쇄산업기사', '인쇄설계기사']},
        {'label': '162. 목재/가구/공예', 'value': ['가구제작기능사', '귀금속가공기능사', '도자공예기능사', '목공예기능사', '보석가공기능사', '보석감정사', '석공예기능사', '피아노조율기능사', '가구제작산업기사', '귀금속가공산업기사', '보석감정산업기사', '보석디자인산업기사', '피아노조율산업기사', '귀금속가공기능장']},
    ], 
    [
        {'label': '171. 농업', 'value': ['원예기능사', '유기농업기능사', '종자기능사', '화훼장식기능사', '유기농업산업기사', '종자산업기사', '화훼장식산업기사', '시설원예기사', '유기농업기사', '종자기사', '화훼장식기사', '농화학기술사', '시설원예기술사', '종자기술사']},
        {'label': '172. 축산', 'value': ['축산기능사', '식육처리기능사', '축산산업기사', '축산기사', '축산기술사']},
        {'label': '173. 임업', 'value': ['버섯종균기능사', '산림기능사', '임업종묘기능사', '목재가공기능사', '펄프종이제조기능사', '버섯산업기사', '산림산업기사', '식물보호산업기사', '산림기사', '식물보호기사', '임산가공기사', '임업종묘기사', '산림기술사']},
        {'label': '174. 어업', 'value': ['수산양식기능사', '수산양식산업기사', '어로산업기사', '수산양식기사', '어업생산관리기사', '수산양식기술사', '어로기술사']},
    ],
    [
        {'label': '181. 안전관리', 'value': ['가스기능사', '가스산업기사', '건설안전산업기사', '산업안전산업기사', '산업위생관리산업기사', '소방설비산업기사(기계)', '소방설비산업기사(전기)', '화재감식평가산업기사', '가스기사', '건설안전기사', '산업안전기사', '산업위생관리기사', '소방설비기사(기계)', '소방설비기사(전기)', '인간공학기사', '화재감식평가기사', '농작업안전보건기사', '방재기사', '가스기능장', '가스기술사', '건설안전기술사', '기계안전기술사', '산업위생관리기술사', '소방기술사', '인간공학기술사', '전기안전기술사', '화공안전기술사']},
        {'label': '182. 비파괴검사', 'value': ['방사선비파괴검사기능사', '자기비파괴검사기능사', '초음파비파괴검사기능사', '침투비파괴검사기능사', '방사선비파괴검사산업기사', '자기비파괴검사산업기사', '초음파비파괴검사산업기사', '침투비파괴검사산업기사', '누설비파괴검사기사', '방사선비파괴검사기사', '와전류비파괴검사기사', '자기비파괴검사기사', '초음파비파괴검사기사', '침투비파괴검사기사', '비파괴검사기술사']},
    ], 
    [
        {'label': '191. 환경', 'value': ['환경기능사', '대기환경산업기사', '소음진동산업기사', '수질환경산업기사', '자연생태복원산업기사', '폐기물처리산업기사', '대기환경기사', '생물분류기사(동물)', '생물분류기사(식물)', '소음진동기사', '수질환경기사', '자연생태복원기사', '토양환경기사', '폐기물처리기사', '온실가스관리기사', '환경위해관리기사', '대기관리기술사', '소음진동기술사', '수질관리기술사', '자연환경관리기술사', '토양환경기술사', '폐기물처리기술사']},
        {'label': '192. 에너지/기상', 'value': ['에너지관리기능사', '신재생에너지발전설비기능사(태양광)', '에너지관리산업기사', '신재생에너지발전설비산업기사(태양광)', '기상기사', '기상감정기사', '원자력기사', '에너지관리기사', '신재생에너지발전설비기사(태양광)', '에너지관리기능장', '기상예보기술사', '방사선관리기술사', '원자력발전기술사']},
    ]
]


# de = DaoEmp()
# result = de.selectList()
# for d in result:
#     de = ""
#     if len(d)>3:
#         de = d[:-2]
#     else :
#         de = d[:-1]
#     for arr in innerIndex:
#         for di in arr:
#             label = di['label']
#             if label.__contains__(de):
#                 print(label,de)



for i in innerIndex:
    for j in i:
        for idx,k in enumerate(j['value']):
            print(k)
            if idx > 3:
                break