lastIndex = [
 {'label':'0', 'value':['경영', '회계', '사무']}, 
 {'label':'1', 'value':['교육', '자연과학', '사회과학']}, 
 {'label':'2', 'value':['보건', '의료']}, 
 {'label':'3', 'value':['사회복지', '종교']}, 
 {'label':'4', 'value':['문화', '예술', '디자인', '방송']}, 
 {'label':'5', 'value':['운전', '운송']}, 
 {'label':'6', 'value':['영업', '판매']}, 
 {'label':'7', 'value':['이용', '숙박', '여행', '오락', '스포츠']}, 
 {'label':'8', 'value':['음식서비스']}, 
 {'label':'9', 'value':['광업자원']}, 
 {'label':'10', 'value':['재료']}, 
 {'label':'11', 'value':['화학']}, 
 {'label':'12', 'value':['섬유', '의복']}, 
 {'label':'13', 'value':['전기', '전자']}, 
 {'label':'14', 'value':['정보통신']}, 
 {'label':'15', 'value':['식품가공']}, 
 {'label':'16', 'value':['인쇄', '목재', '가구', '공예']}, 
 {'label':'17', 'value':['농림어업']}, 
 {'label':'18', 'value':['안전관리']}, 
 {'label':'19', 'value':['환경', '에너지']}
]

